import math

def reshenie(a, b, c):
    if a == 0 or b == 0 or c == 0:
        if a == 0 and b == 0 and c == 0:
            x = "Уравнение верно для любого значения X (x ∈ R)"
        elif a == 0 and b == 0 and c != 0:
            x = "Уравнение ложно для любого значения X (x ∈ Ø)"
        elif a == 0 and b != 0 and c == 0:
            x = "Уравнение имеет 1 корень X = 0"
        elif a == 0 and b != 0 and c != 0:
            x = f"Уравнение имеет 1 корень X = {-c/b}"
        elif a != 0 and b == 0 and c == 0:
            x = "Уравнение имеет 2 повторяющихся кореня X = 0"
        elif a != 0 and b == 0 and c != 0:
            if (c > 0 and a > 0) or (c < 0 and a < 0):
                x = "Действительных корней нет (x ∉ R)"
            else:
                x = f"Данное уравение имеет 2 кореня X1 = {-(-c/a)**0.5}, X2 = {(-c/a)**0.5}"
        else:
            x = f"Данное уравение имеет 2 кореня X1 = {0.0}, X2 = {-b / a}"
    else:
        d = b**2 - 4*a*c
        if d > 0:
            x = f"Данное уравение имеет 2 кореня X1 = {(-b - d**0.5) / (2*a)}, X2 = {(-b + d**0.5) / (2*a)}"
        elif d == 0:
            x = f"Данное уравение имеет 1 корень X1 = {-b /(2*a)}"
        else:
            x = "Действительных корней нет (x ∉ R)"

    return x

